




# Домашине до 01.10.2024
# Задание 1
# Создайте класс Device, который содержит информацию об устройстве. Спомощью механизма наследования, реализуйте
# класс CoffeeMachine (содержит информацию о кофемашине), класс Blender (содержит информацию о блендере), класс
# MeatGrinder (содержит информацию о мясорубке). Каждый из классов должен содержать необходимые для работы методы.


# from OOPexp import CoffeeMachine, Blender, MeatGrinder
#
# devices = [
#     CoffeeMachine('Самсуунг', 'Китай', 25, '220', 'металличесский'),
#     Blender('Бош', 'Германия', 22, '220', 'пластиковый'),
#     MeatGrinder('Тошиба', 'Япония', 24, '220', 'металлический')
# ]
#
# for dev in devices:
#     dev.about()
#     dev.model()
#     dev.socet()
#     dev.guarantee()



# Задание 2
# Создайте класс Ship, который содержит информацию о корабле.
# С помощью механизма наследования, реализуйте класс Frigate (содержит информацию о фрегате), класс
# Destroyer (содержит информацию об эсминце), класс Cruiser (содержит информацию о крейсере).
# Каждый из классов должен содержать необходимые для работы методы.


# from OOPexp import Frigate, Destroyer, Cruiser
#
# ships = [
#     Frigate('Magelan', '50 тонн', 100000, '1976', 'Австралия'),
#     Destroyer('Теадор Рузвельт', '48 тонн', 125000, '1982', 'USA'),
#     Cruiser('Москва', '60 тон', 176000, '1983', 'РФ')
# ]
#
# for dev in ships:
#     dev.about()
#     dev.displacement()
#     dev.armament()
#     dev.affiliation()



# Домашние до 03.10.2024
# Задание 1
# Создать базовый класс Фигура с методом для подсчета площади. Создать производные классы: прямоугольник,
# круг, прямоугольный треугольник, трапеция со своими методами для подсчета площади.

# from OOPexp import Circle, Square, Tirangle
#
# figures = [
#     Circle(2, 3, 5),
#     Square(5),
#     Tirangle(3, 1.5)
# ]
#
# for fig in figures:
#     fig.about()
